# 2. Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# [2, 3, 4, 5, 6] => [12, 15, 16];
# [2, 3, 5, 6] => [12, 15]

sp = [2, 3, 4, 5, 6]
z = sp[len(sp) // 2]
for i in range(len(sp) // 2):
    x = sp[i] * sp[-1 - i]
    print(x)
if len(sp) % 2 != 0:
    print(z ** 2)
