# 1. Задайте строку из набора чисел. Напишите программу, которая покажет большее и меньшее число.
# В качестве символа-разделителя используйте пробел.

sp = [3, 4, 2, 7, 1, 9, 8]

print(sp)
print(' max =', max(sp), '\n', 'min =', min(sp))